; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_17)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - person
	)

  (:init
		(= (x b0) -6)
(= (y b0) 0)
(= (x b1) -1)
(= (y b1) 0)
(= (x b2) 6)
(= (y b2) 0)
(= (x b3) 1)
(= (y b3) 0)
(= (x b4) 5)
(= (y b4) 0)
(= (x b5) -2)
(= (y b5) 0)
(= (x b6) -6)
(= (y b6) 0)
(= (x b7) -1)
(= (y b7) 0)
(= (x b8) 7)
(= (y b8) 0)
(= (x b9) -8)
(= (y b9) 0)
(= (x b10) 3)
(= (y b10) 0)

		(= (d p0) 39)
(= (d p1) 45)
(= (d p2) 56)
(= (d p3) 61)
(= (d p4) 73)
(= (d p5) 56)
(= (d p6) 27)
(= (d p7) 79)
(= (d p8) 18)
(= (d p9) 61)
(= (d p10) 45)
(= (d p11) 63)
(= (d p12) 60)
(= (d p13) 32)
(= (d p14) 81)
(= (d p15) 14)
(= (d p16) 14)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
		)
	)
)

; plan
1. (go_north_east b7)
   changed: (x b7) from -1 to 0.5, (y b7) from 0 to 1.5
   goals met: 0 of 17
2. (go_north_east b7)
   changed: (x b7) from 0.5 to 2, (y b7) from 1.5 to 3
   goals met: 0 of 17
3. (go_north_east b7)
   changed: (x b7) from 2 to 3.5, (y b7) from 3 to 4.5
   goals met: 0 of 17
4. (go_north_east b7)
   changed: (x b7) from 3.5 to 5, (y b7) from 4.5 to 6
   goals met: 0 of 17
5. (go_north_east b7)
   changed: (x b7) from 5 to 6.5, (y b7) from 6 to 7.5
   goals met: 0 of 17
6. (go_north_east b7)
   changed: (x b7) from 6.5 to 8, (y b7) from 7.5 to 9
   goals met: 0 of 17
7. (go_north_east b7)
   changed: (x b7) from 8 to 9.5, (y b7) from 9 to 10.5
   goals met: 0 of 17
8. (go_north_east b7)
   changed: (x b7) from 9.5 to 11, (y b7) from 10.5 to 12
   goals met: 0 of 17
9. (go_north_east b7)
   changed: (x b7) from 11 to 12.5, (y b7) from 12 to 13.5
   goals met: 0 of 17
10. (go_north_east b7)
   changed: (x b7) from 12.5 to 14, (y b7) from 13.5 to 15
   goals met: 0 of 17
11. (go_north_east b7)
   changed: (x b7) from 14 to 15.5, (y b7) from 15 to 16.5
   goals met: 0 of 17
12. (go_north_east b7)
   changed: (x b7) from 15.5 to 17, (y b7) from 16.5 to 18
   goals met: 0 of 17
13. (go_north_east b7)
   changed: (x b7) from 17 to 18.5, (y b7) from 18 to 19.5
   goals met: 0 of 17
14. (go_north_east b7)
   changed: (x b7) from 18.5 to 20, (y b7) from 19.5 to 21
   goals met: 0 of 17
15. (go_west b7)
   changed: (x b7) from 20 to 17
   goals met: 0 of 17
16. (go_north_west b7)
   changed: (x b7) from 17 to 15.5, (y b7) from 21 to 22.5
   goals met: 0 of 17
17. (go_north_west b7)
   changed: (x b7) from 15.5 to 14, (y b7) from 22.5 to 24
   goals met: 0 of 17
18. (go_north_west b7)
   changed: (x b7) from 14 to 12.5, (y b7) from 24 to 25.5
   goals met: 0 of 17
19. (go_north_west b7)
   changed: (x b7) from 12.5 to 11, (y b7) from 25.5 to 27
   goals met: 0 of 17
20. (save_person b7 p15)
   added: (saved p15)
   goals met: 1 of 17
21. (save_person b7 p16)
   added: (saved p16)
   goals met: 2 of 17
22. (go_north_east b7)
   changed: (x b7) from 11 to 12.5, (y b7) from 27 to 28.5
   goals met: 2 of 17
23. (go_north_west b7)
   changed: (x b7) from 12.5 to 11, (y b7) from 28.5 to 30
   goals met: 2 of 17
24. (save_person b7 p8)
   added: (saved p8)
   goals met: 3 of 17
25. (go_north_east b7)
   changed: (x b7) from 11 to 12.5, (y b7) from 30 to 31.5
   goals met: 3 of 17
26. (go_north_east b7)
   changed: (x b7) from 12.5 to 14, (y b7) from 31.5 to 33
   goals met: 3 of 17
27. (go_north_east b7)
   changed: (x b7) from 14 to 15.5, (y b7) from 33 to 34.5
   goals met: 3 of 17
28. (go_north_east b7)
   changed: (x b7) from 15.5 to 17, (y b7) from 34.5 to 36
   goals met: 3 of 17
29. (go_north_east b7)
   changed: (x b7) from 17 to 18.5, (y b7) from 36 to 37.5
   goals met: 3 of 17
30. (go_north_west b7)
   changed: (x b7) from 18.5 to 17, (y b7) from 37.5 to 39
   goals met: 3 of 17
31. (go_north_west b7)
   changed: (x b7) from 17 to 15.5, (y b7) from 39 to 40.5
   goals met: 3 of 17
32. (go_north_west b7)
   changed: (x b7) from 15.5 to 14, (y b7) from 40.5 to 42
   goals met: 3 of 17
33. (go_north_west b7)
   changed: (x b7) from 14 to 12.5, (y b7) from 42 to 43.5
   goals met: 3 of 17
34. (go_north_west b7)
   changed: (x b7) from 12.5 to 11, (y b7) from 43.5 to 45
   goals met: 3 of 17
35. (save_person b7 p13)
   added: (saved p13)
   goals met: 4 of 17
36. (go_north_west b7)
   changed: (x b7) from 11 to 9.5, (y b7) from 45 to 46.5
   goals met: 4 of 17
37. (go_north_west b7)
   changed: (x b7) from 9.5 to 8, (y b7) from 46.5 to 48
   goals met: 4 of 17
38. (save_person b7 p0)
   added: (saved p0)
   goals met: 5 of 17
39. (go_north_west b7)
   changed: (x b7) from 8 to 6.5, (y b7) from 48 to 49.5
   goals met: 5 of 17
40. (go_north_west b7)
   changed: (x b7) from 6.5 to 5, (y b7) from 49.5 to 51
   goals met: 5 of 17
41. (save_person b7 p1)
   added: (saved p1)
   goals met: 6 of 17
42. (save_person b7 p10)
   added: (saved p10)
   goals met: 7 of 17
43. (go_north_west b7)
   changed: (x b7) from 5 to 3.5, (y b7) from 51 to 52.5
   goals met: 7 of 17
44. (go_north_west b7)
   changed: (x b7) from 3.5 to 2, (y b7) from 52.5 to 54
   goals met: 7 of 17
45. (go_south_east b7)
   changed: (x b7) from 2 to 0, (y b7) from 54 to 52
   goals met: 7 of 17
46. (save_person b7 p6)
   added: (saved p6)
   goals met: 8 of 17
47. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 52 to 53.5
   goals met: 8 of 17
48. (go_north_east b7)
   changed: (x b7) from 1.5 to 3, (y b7) from 53.5 to 55
   goals met: 8 of 17
49. (go_north_west b7)
   changed: (x b7) from 3 to 1.5, (y b7) from 55 to 56.5
   goals met: 8 of 17
50. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 56.5 to 58
   goals met: 8 of 17
51. (save_person b7 p2)
   added: (saved p2)
   goals met: 9 of 17
52. (save_person b7 p5)
   added: (saved p5)
   goals met: 10 of 17
53. (go_north_west b7)
   changed: (x b7) from 0 to -1.5, (y b7) from 58 to 59.5
   goals met: 10 of 17
54. (go_north_east b7)
   changed: (x b7) from -1.5 to 0, (y b7) from 59.5 to 61
   goals met: 10 of 17
55. (save_person b7 p3)
   added: (saved p3)
   goals met: 11 of 17
56. (save_person b7 p9)
   added: (saved p9)
   goals met: 12 of 17
57. (save_person b7 p12)
   added: (saved p12)
   goals met: 13 of 17
58. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 61 to 62.5
   goals met: 13 of 17
59. (go_north_east b7)
   changed: (x b7) from 1.5 to 3, (y b7) from 62.5 to 64
   goals met: 13 of 17
60. (go_north_east b7)
   changed: (x b7) from 3 to 4.5, (y b7) from 64 to 65.5
   goals met: 13 of 17
61. (go_north_east b7)
   changed: (x b7) from 4.5 to 6, (y b7) from 65.5 to 67
   goals met: 13 of 17
62. (go_north_east b7)
   changed: (x b7) from 6 to 7.5, (y b7) from 67 to 68.5
   goals met: 13 of 17
63. (go_north_east b7)
   changed: (x b7) from 7.5 to 9, (y b7) from 68.5 to 70
   goals met: 13 of 17
64. (go_north_west b7)
   changed: (x b7) from 9 to 7.5, (y b7) from 70 to 71.5
   goals met: 13 of 17
65. (save_person b7 p11)
   added: (saved p11)
   goals met: 14 of 17
66. (go_north_west b7)
   changed: (x b7) from 7.5 to 6, (y b7) from 71.5 to 73
   goals met: 14 of 17
67. (go_north_west b7)
   changed: (x b7) from 6 to 4.5, (y b7) from 73 to 74.5
   goals met: 14 of 17
68. (go_north_west b7)
   changed: (x b7) from 4.5 to 3, (y b7) from 74.5 to 76
   goals met: 14 of 17
69. (save_person b7 p4)
   added: (saved p4)
   goals met: 15 of 17
70. (go_north_west b7)
   changed: (x b7) from 3 to 1.5, (y b7) from 76 to 77.5
   goals met: 15 of 17
71. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 77.5 to 79
   goals met: 15 of 17
72. (save_person b7 p7)
   added: (saved p7)
   goals met: 16 of 17
73. (go_north_east b7)
   changed: (x b7) from 0 to 1.5, (y b7) from 79 to 80.5
   goals met: 16 of 17
74. (go_north_west b7)
   changed: (x b7) from 1.5 to 0, (y b7) from 80.5 to 82
   goals met: 16 of 17
75. (save_person b7 p14)
   added: (saved p14)
   goals met: 17 of 17
